{
    "intents": [
        {
            "tag": "saludo",
            "patterns": [
                "hola",
                "¿qué tal?",
                "buenos días",
                "saludos",
                "buenas",
                "qué onda",
                "qué pasa",
                "buen día, cómo estás",
                "hola, espero que estés bien",
                "saludos, ¿cómo va todo?",
                "hola, ¿todo bien?",
                "buenas tardes, ¿cómo te va?",
                "buenos días, ¿cómo amaneciste?"
            ],
            "responses": [
                "¡Hola {name}! ¿Cómo puedo ayudarte hoy?",
                "¡Buenas {name}! ¿En qué te puedo ser útil?",
                "¡Hola {name}! Espero que estés bien. ¿Cómo puedo asistirte?",
                "¡Saludos {name}! ¿Hay algo en particular con lo que necesites ayuda?",
                "¡Hola {name}! ¿Todo bien? ¿Te puedo ayudar en algo?",
                "¡Qué tal {name}! ¿Cómo puedo ayudarte hoy?",
                "¡Buen día {name}! ¿Hay algo con lo que necesites asistencia?"
            ]
        },
        {
            "tag": "informacion_asistente",
            "patterns": [
                "¿Cómo te llamas?",
                "¿Cuál es tu nombre?",
                "Me gustaría saber tu nombre",
                "¿Cómo es que te llamas?",
                "Dime tu nombre",
                "¿Quién eres?",
                "¿Tienes nombre?",
                "¿Cómo te identificas?",
                "¿Cuál es tu identidad?",
                "¿Cuál es tu función aquí como asistente virtual?",
                "¿Que haces?"
            ],
            "responses": [
                "Me llamo DocMe, soy tu asistente virtual aquí para ayudarte con las dudas que tengas sobre tus citas médicas y más.",
                "Soy DocMe, el asistente de chat diseñado especialmente para ayudarte con tus necesidades médicas. ¿En qué más puedo asistirte hoy?",
                "Como asistente de la aplicación DocMe, me llamo precisamente eso, DocMe. Estoy aquí para ayudarte a gestionar tus citas médicas, recetas y consultas médicas. ¿Cómo puedo ayudarte hoy?",
                "Mi nombre es DocMe. Estoy aquí para facilitar la gestión de tus citas médicas y para asegurarme de que tu experiencia en el cuidado de la salud sea lo más fluida posible."
            ]
        },
        {
            "tag": "estado_animo_mal",
            "patterns": [
                "me siento mal",
                "no muy bien",
                "fatal",
                "enfermo",
                "grave",
                "tengo una enfermedad",
                "hoy no es mi mejor día",
                "me siento un poco deprimido últimamente",
                "últimamente me he sentido abajo",
                "me siento triste hoy",
                "tengo sentimientos de tristeza",
                "me siento emocionalmente agotado",
                "estoy lidiando con mucha ansiedad",
                "he estado sintiéndome muy deprimido"
            ],
            "responses": [
                "Lo siento escuchar eso. Puedo ayudarte a programar una cita con un médico para que te revise. ¿Te gustaría hacerlo ahora?",
                "Lamento escuchar eso. Espero que todo mejore. ¿Hay algo en lo que te pueda ayudar hoy?",
                "Me preocupa escuchar eso. Es importante que un médico te evalúe. ¿Te ayudo a programar una cita?",
                "Vaya, eso no suena bien. Puedo guiarte para que puedas agendar una cita médica rápidamente. ¿Deseas proceder?",
                "Es duro sentirse así. Estoy aquí para ayudarte a encontrar el apoyo que necesitas. ¿Quieres que te asista en programar una visita al especialista?",
                "Entiendo que es un momento difícil. Si necesitas hablar con un profesional, puedo organizarlo de inmediato. ¿Cómo te gustaría proceder?"
            ]
        },
        {
            "tag": "proxima_cita",
            "patterns": [
                "cuando es mi proxima cita",
                "quiero saber mi siguiente cita",
                "que dia es mi proxima cita",
                "necesito confirmar la fecha de mi próxima cita",
                "cuándo tengo agendada mi próxima visita",
                "podrías informarme sobre mi próxima cita médica",
                "¿serías tan amable de decirme la fecha y la hora de mi cita que viene?",
                "me podrías confirmar el día y la hora de mi siguiente visita médica",
                "tengo curiosidad sobre cuándo está programada mi próxima cita",
                "podrías verificar cuándo es mi próxima cita con el doctor",
                "necesitaría saber cuándo es mi próxima visita programada"
            ],
            "responses": [
                "Tu próxima cita es el {date} a las {time} con el médico {doctor} por el motivo de {reason}. ¿Hay algo más en que pueda asistirte?",
                "Déjame verificar... tu siguiente cita es el {date} a las {time} con el médico {doctor}, debido a {reason}. ¿Necesitas algo más?",
                "Has reservado tu siguiente cita para el {date} a las {time} con el médico {doctor} por motivo de {reason}. ¿Necesitas más información?",
                "La fecha de tu próxima cita es el {date} a las {time} con el médico {doctor}, y el motivo es {reason}. ¿Hay algo más en que pueda asistirte?",
                "Estoy viendo que tu siguiente cita es el {date} a las {time} con el médico {doctor}. El motivo de la cita es {reason}. ¿Puedo ayudarte con algo más?",
                "Según lo que tengo registrado, tu próxima cita médica es el {date} a las {time} con {doctor} por {reason}. ¿Te gustaría saber algo más?"
            ]
        },
        {
            "tag": "ultima_cita",
            "patterns": [
                "cuándo fue mi última cita",
                "quiero saber mi última cita",
                "cuál fue mi última cita",
                "de cuándo es la última cita mía",
                "podrías decirme cuándo fue mi última visita al consultorio",
                "necesito recordar mi última cita",
                "cuándo visité por última vez el consultorio",
                "dime la fecha de mi última cita",
                "recuérdame la última vez que estuve allí",
                "dame la fecha de mi cita pasada"
            ],
            "responses": [
                "Tu última cita fue el {date} a las {time} con el médico {doctor} por el motivo de {reason}. ¿Hay algo más en que pueda asistirte?",
                "Déjame ver... tu última cita fue el {date} a las {time} con el médico {doctor}, debido a {reason}. ¿Necesitas algo más?",
                "Tu última cita se realizó el {date} a las {time} con el médico {doctor} para discutir {reason}. ¿Hay algo más con lo que necesites ayuda?",
                "Revisando tus registros, tu última cita ocurrió el {date} a las {time} con el médico {doctor}, y el motivo fue {reason}. ¿Puedo ayudarte con algo más?",
                "Acabo de comprobar que tu última cita tuvo lugar el {date} a las {time} con el médico {doctor}. El motivo de la cita fue {reason}. ¿Necesitas otro servicio o tienes alguna otra consulta?",
                "Tu última cita se realizó el {date} a las {time} con el médico {doctor} sobre {reason}. ¿Hay algo más con lo que necesites ayuda?"
            ]
        },
        {
            "tag": "agradecimiento",
            "patterns": [
                "ok, gracias",
                "muchas gracias",
                "te lo agradezco",
                "estoy agradecido",
                "eres muy amable",
                "bueno, gracias",
                "dale, gracias",
                "vale, gracias"
            ],
            "responses": [
                "¡De nada! Siempre estoy aquí para ayudarte.",
                "No hay de qué, ¡estoy aquí para asistirte en lo que necesites!",
                "Es un placer ayudarte, ¿hay algo más en que pueda asistirte?",
                "Siempre a tu servicio. No dudes en preguntar si necesitas más ayuda.",
                "¡Fue un placer ayudarte! Si necesitas algo más, sólo tienes que decirlo."
            ]
        },
        {
            "tag": "datos_privados",
            "patterns": [
                "¿Cuál es mi correo?",
                "Necesito mi contraseña",
                "Dime mi identificación",
                "¿Puedes darme mi número de identificación?",
                "¿Cuál es mi número de identificación?"
            ],
            "responses": [
                "Por políticas de seguridad, no puedo proporcionar datos sensibles de los usuarios a través de este medio.",
                "Lamentablemente, no estoy autorizado a compartir o divulgar datos sensibles como contraseñas o información de identificación. Te recomiendo que accedas a tu cuenta de usuario para obtener esa información.",
                "Debido a nuestras políticas de privacidad y seguridad, no puedo acceder ni compartir datos personales sensibles.",
                "Por razones de seguridad, no puedo divulgar información sensible aquí. Por favor, utiliza los medios seguros en nuestro sitio web o app para acceder a esos datos."
            ]
        }
    ]
}