{
    "intents": [
        {
            "tag": "saludo",
            "patterns": [
                "hola",
                "¿qué tal?",
                "buenos días",
                "saludos",
                "buenas",
                "qué onda",
                "qué pasa",
                "buen día, cómo estás",
                "hola, espero que estés bien",
                "saludos, ¿cómo va todo?",
                "hola, ¿todo bien?",
                "buenas tardes, ¿cómo te va?",
                "buenos días, ¿cómo amaneciste?"
            ],
            "responses": [
                "¡Hola {name}!, ¿Cómo puedo ayudarte?",
                "¡Buenas {name}!, ¿En qué te puedo ser útil?",
                "¡Hola {name}! Espero que estés bien. ¿Cómo puedo asistirte?",
                "¡Saludos {name}!, ¿Hay algo en particular con lo que necesites ayuda?",
                "¡Hola {name}!, ¿Te puedo ayudar en algo?",
                "¡Qué tal {name}!, ¿Cómo puedo ayudarte hoy?",
                "¡Buen día {name}!, ¿Hay algo con lo que necesites asistencia?"
            ]
        },
        {
            "tag": "informacion_asistente",
            "patterns": [
                "¿Cómo te llamas?",
                "¿Cuál es tu nombre?",
                "Me gustaría saber tu nombre",
                "¿Cómo es que te llamas?",
                "Dime tu nombre",
                "¿Quién eres?",
                "¿Tienes nombre?",
                "¿Cómo te identificas?",
                "¿Cuál es tu identidad?",
                "¿Cuál es tu función aquí como asistente virtual?",
                "¿Qué haces?",
                "¿Qué funciones puedes realizar?",
                "Me gustaría saber más acerca de ti"
            ],
            "responses": [
                "Me llamo DocMe, soy tu asistente virtual aquí para ayudarte con cualquier duda que tengas, especialmente sobre tus citas médicas y más.",
                "Soy DocMe, el asistente de chat diseñado para ayudarte en tus necesidades médicas. ¿Hay algo más en lo que puedo asistirte?",
                "Mi nombre es DocMe. Facilito la gestión de tus citas médicas y me aseguro de que tu experiencia en el cuidado de la salud sea lo más fluida posible."
            ]
        },
        {
            "tag": "malestar_emocional",
            "patterns": [
                "me siento mal",
                "no muy bien",
                "fatal",
                "hoy no es mi mejor día",
                "me siento un poco deprimido últimamente",
                "últimamente me he sentido abajo",
                "me siento triste hoy",
                "tengo sentimientos de tristeza",
                "me siento emocionalmente agotado",
                "estoy lidiando con mucha ansiedad",
                "he estado sintiéndome muy deprimido"
            ],
            "responses": [
                "Lo siento mucho que te sientas así. ¿Hay algo específico que haya causado que te sientas mal últimamente? Estoy aquí para escucharte.",
                "Parece que estás pasando por un momento difícil. A veces, hablar con alguien puede ayudar mucho. ¿Te gustaría que te ponga en contacto con un consejero o un terapeuta?",
                "Lamento escuchar que te sientes de esta manera. Recuerda, no estás solo en esto y hay personas que pueden ayudarte. ¿Quieres que busque recursos de apoyo emocional para ti?",
                "Entiendo que no te sientas bien, y es totalmente válido sentirse así. Si crees que sería útil, puedo ayudarte a encontrar un grupo de apoyo o un profesional de la salud mental.",
                "Escuchar que te sientes así me preocupa. Si sientes que todo se está volviendo demasiado, es importante buscar ayuda profesional. ¿Te gustaría que te ayude a programar una cita?",
                "Es completamente normal tener días malos, pero si estos sentimientos persisten, podría ser beneficioso hablar con alguien que pueda ofrecer soporte. ¿Puedo asistirte para encontrar ayuda profesional?",
                "Lamento que te encuentres en esta situación. A veces, solo expresar lo que sientes puede ser un gran paso hacia sentirte mejor. Estoy aquí para escucharte, o si prefieres, puedo ayudarte a contactar a un profesional.",
                "Todos tenemos momentos difíciles, y hablar sobre lo que sientes es un paso importante. ¿Te gustaría que te dé información sobre cómo contactar a un especialista en salud mental?"
            ]
        },
        {
            "tag": "malestar_fisico_general",
            "patterns": [
                "enfermo",
                "grave",
                "tengo una enfermedad",
                "tengo fiebre"
            ],
            "responses": [
                "Parece que podrías estar enfermo. Sería bueno que veas a un médico lo antes posible. ¿Quieres que te ayude a agendar una cita?",
                "Lamento escuchar que te sientes mal. ¿Has tomado algún medicamento? Si los síntomas continúan, te recomendaría visitar a un médico.",
                "Es importante cuidarte, especialmente si sientes que algo no va bien. ¿Te gustaría que busque un centro médico cercano para ti?",
                "Me preocupa que te sientas así. Descansar y mantenerse hidratado es crucial. Si los síntomas empeoran, por favor considera visitar a un profesional de la salud.",
                "Escuchar que no te sientes bien es preocupante. Asegúrate de descansar y beber suficiente agua. ¿Hay algo más que pueda hacer por ti, como encontrar una farmacia cercana?",
                "Tu salud es lo más importante. Si tienes presentas sintomas que te preocupan, podría ser una buena idea hablar con un médico. ¿Puedo ayudarte a encontrar atención médica?",
                "Parece que necesitas cuidarte un poco. Mantenerte en reposo y bien hidratado son pasos importantes. Si sientes que necesitas ver a un médico, estoy aquí para ayudarte a hacer una cita.",
                "Lamento que no te encuentres bien. A veces, los síntomas pueden ser señal de algo que necesita atención médica. ¿Te gustaría que te busque un servicio de salud para evaluar tus síntomas?"
            ]
        },
        {
            "tag": "proxima_cita",
            "patterns": [
                "cuando es mi próxima cita",
                "¿Mi cita cuando es?",
                "quiero saber mi siguiente cita",
                "qué día es mi próxima cita",
                "necesito confirmar la fecha de mi próxima cita",
                "cuándo tengo agendada mi próxima visita",
                "podrías informarme sobre mi próxima cita médica",
                "¿serías tan amable de decirme la fecha y la hora de mi próxima cita?",
                "me podrías confirmar el día y la hora de mi siguiente visita médica",
                "tengo curiosidad sobre cuándo está programada mi próxima cita",
                "podrías verificar cuándo es mi próxima cita con el doctor",
                "necesitaría saber cuándo es mi próxima visita programada"
            ],
            "responses": [
                "Tu próxima cita es el {date} a las {time} con el médico {doctor} por el motivo de {reason}. ¿Hay algo más en que pueda asistirte?",
                "Déjame verificar... tu siguiente cita es el {date} a las {time} con el médico {doctor}, debido a {reason}. ¿Necesitas algo más?",
                "Has reservado tu siguiente cita para el {date} a las {time} con el médico {doctor} por motivo de {reason}. ¿Necesitas más información?",
                "La fecha de tu próxima cita es el {date} a las {time} con el médico {doctor}, y el motivo es {reason}. ¿Hay algo más en que pueda asistirte?",
                "Estoy viendo que tu siguiente cita es el {date} a las {time} con el médico {doctor}. El motivo de la cita es {reason}. ¿Puedo ayudarte con algo más?",
                "Según lo que tengo registrado, tu próxima cita médica es el {date} a las {time} con {doctor} por {reason}. ¿Te gustaría saber algo más?"
            ]
        },
        {
            "tag": "ultima_cita",
            "patterns": [
                "cuándo fue mi última cita",
                "quiero saber mi última cita",
                "cuál fue mi última cita",
                "de cuándo es la última cita mía",
                "podrías decirme cuándo fue mi última visita al consultorio",
                "necesito recordar mi última cita",
                "cuándo visité por última vez el consultorio",
                "dime la fecha de mi última cita",
                "recuérdame la última vez que estuve allí",
                "dame la fecha de mi cita pasada"
            ],
            "responses": [
                "Tu última cita fue el {date} a las {time} con el médico {doctor} por el motivo de {reason}. ¿Hay algo más en que pueda asistirte?",
                "Déjame ver... tu última cita fue el {date} a las {time} con el médico {doctor}, debido a {reason}. ¿Necesitas algo más?",
                "Tu última cita se realizó el {date} a las {time} con el médico {doctor}, el motivo fue {reason}. ¿Hay algo más con lo que necesites ayuda?",
                "Revisando tus registros, tu última cita ocurrió el {date} a las {time} con el médico {doctor}, y el motivo fue {reason}. ¿Puedo ayudarte con algo más?",
                "Acabo de comprobar que tu última cita tuvo lugar el {date} a las {time} con el médico {doctor}. El motivo de la cita fue {reason}. ¿Necesitas otro servicio o tienes alguna otra consulta?",
                "Tu última cita se realizó el {date} a las {time} con el médico {doctor} sobre {reason}. ¿Hay algo más con lo que necesites ayuda?"
            ]
        },
        {
            "tag": "agradecimiento",
            "patterns": [
                "ok, gracias",
                "muchas gracias",
                "te lo agradezco",
                "estoy agradecido",
                "eres muy amable",
                "bueno, gracias",
                "dale, gracias",
                "vale, gracias",
                "aprecio la asistencia que me has proporcionado",
                "fue de gran ayuda"
            ],
            "responses": [
                "¡De nada! Estoy aquí para ayudarte con cualquier cosa que necesites.",
                "No hay de qué. Siempre estoy disponible para asistirte.",
                "Es un placer ayudarte. No dudes en contactarme si necesitas más ayuda."
            ]
        },
        {
            "tag": "datos_privados",
            "patterns": [
                "¿Cuál es mi correo?",
                "Necesito mi contraseña",
                "Dime mi identificación",
                "¿Puedes darme mi número de identificación?",
                "¿Cuál es mi número de identificación?",
                "¿Puedes confirmarme mis datos personales?",
                "¿Puedes verificar algunos de mis datos personales?"
            ],
            "responses": [
                "Por razones de seguridad, no puedo proporcionar detalles como tu correo, contraseña o identificación. Te recomiendo acceder a tu cuenta personal a través de nuestra página web o aplicación para gestionar y visualizar de manera segura esta información.",
                "Entiendo que necesites esa información, pero por seguridad no puedo divulgar datos personales como correos, contraseñas o números de identificación. Puedes revisar estos detalles iniciando sesión en tu cuenta en nuestra plataforma.",
                "Para proteger tu privacidad y seguridad, no estoy autorizado a proporcionar o confirmar datos personales sensibles como correos electrónicos o números de identificación. Por favor, utiliza las herramientas seguras en nuestra app o sitio web para acceder a esos datos.",
                "Lamento las molestias, pero por políticas de seguridad, no puedo compartir información confidencial como tu correo o contraseña. Por favor, accede a tu perfil en nuestra aplicación o sitio web para consultar o actualizar tus datos de manera segura."
            ]
        }
      
    ]
}